# Directcontext3dServerId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..Directcontext3dServerId Property
ParameterTypeId Class See Also
---
"ServerId"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId Directcontext3dServerId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Directcontext3dServerId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Directcontext3dServerId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace